zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_i2c_smbus.h
/**
  *******************************************************************************************************
  * @file    fm33fg0xxa_fl_i2c_smbus.h
  * @author  FMSH Application Team
  * @brief   Head file of I2C_SMBUS FL Module
  *******************************************************************************************************
  * @attention    
  * Copyright (c) 2023, SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICROELECTRONICS./ FUDAN MICRO.)    
  * All rights reserved.    
  *    
  * Processor:                   FM33FG0xxA    
  * http:                        http://www.fmdevelopers.com.cn/    
  *    
  * Redistribution and use in source and binary forms, with or without    
  * modification, are permitted provided that the following conditions are met    
  *    
  * 1. Redistributions of source code must retain the above copyright notice,    
  *    this list of conditions and the following disclaimer.    
  *    
  * 2. Redistributions in binary form must reproduce the above copyright notice,    
  *    this list of conditions and the following disclaimer in the documentation    
  *    and/or other materials provided with the distribution.    
  *    
  * 3. Neither the name of the copyright holder nor the names of its contributors    
  *    may be used to endorse or promote products derived from this software    
  *    without specific prior written permission.    
  *    
  * 4. To provide the most up-to-date information, the revision of our documents     
  *    on the World Wide Web will be the most Current. Your printed copy may be      
  *    an earlier revision. To verify you have the latest information avaliable,    
  *    refer to: http://www.fmdevelopers.com.cn/.    
  *    
  * THIS SOFTWARE IS PROVIDED BY FUDAN MICRO "AS IS" AND ANY EXPRESSED:     
  * ORIMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES     
  * OF MERCHANTABILITY NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE    
  * ARE DISCLAIMED.IN NO EVENT SHALL FUDAN MICRO OR ITS CONTRIBUTORS BE LIABLE     
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL     
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS     
  * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER    
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,     
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISINGIN ANY WAY OUT OF THE     
  * USE OF THIS SOFTWARE, EVEN IF ADVISED OFTHE POSSIBILITY OF SUCH DAMAGE.    
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FG0XXA_FL_I2C_SMBUS_H
#define __FM33FG0XXA_FL_I2C_SMBUS_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fg0xxa_fl_def.h"
/** @addtogroup FM33FG0XXA_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup I2C_SMBUS_FL_ES_INIT I2C_SMBUS Exported Init structures
  * @{
  */

/**
  * @brief FL I2C_SMBUS Init Sturcture definition
  */
typedef struct
{
    /** 主机时使用的时钟源*/
    uint32_t clockSource;

    /** I2C通讯速率*/
    uint32_t baudRate;

} FL_I2C_SMBUS_MasterMode_InitTypeDef;

/**
  * @brief I2C Slavemode Init Sturcture Definition
  */
typedef struct
{
    /** 从机模式从机地址 */
    uint32_t ownAddr;

    /** 从机时使用的时钟源*/
    uint32_t clockSource;

    /** 从机模式地址位宽 */
    FL_FunState ownAddrSize10bit;

    /** 从机时钟延展*/
    FL_FunState SCLSEN;

} FL_I2C_SMBUS_SlaveMode_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup I2C_SMBUS_FL_Exported_Constants I2C_SMBUS Exported Constants
  * @{
  */

#define    I2CSMB_CR1_EN_Pos                                      (0U)
#define    I2CSMB_CR1_EN_Msk                                      (0x1U << I2CSMB_CR1_EN_Pos)
#define    I2CSMB_CR1_EN                                          I2CSMB_CR1_EN_Msk

#define    I2CSMB_CR1_A10EN_Pos                                   (2U)
#define    I2CSMB_CR1_A10EN_Msk                                   (0x1U << I2CSMB_CR1_A10EN_Pos)
#define    I2CSMB_CR1_A10EN                                       I2CSMB_CR1_A10EN_Msk

#define    I2CSMB_CR1_CRCEN_Pos                                   (3U)
#define    I2CSMB_CR1_CRCEN_Msk                                   (0x1U << I2CSMB_CR1_CRCEN_Pos)
#define    I2CSMB_CR1_CRCEN                                       I2CSMB_CR1_CRCEN_Msk

#define    I2CSMB_CR1_DNF_Pos                                     (8U)
#define    I2CSMB_CR1_DNF_Msk                                     (0xfU << I2CSMB_CR1_DNF_Pos)
#define    I2CSMB_CR1_DNF                                         I2CSMB_CR1_DNF_Msk

#define    I2CSMB_CR1_ANFEN_Pos                                   (12U)
#define    I2CSMB_CR1_ANFEN_Msk                                   (0x1U << I2CSMB_CR1_ANFEN_Pos)
#define    I2CSMB_CR1_ANFEN                                       I2CSMB_CR1_ANFEN_Msk

#define    I2CSMB_CR1_TXDMAEN_Pos                                 (14U)
#define    I2CSMB_CR1_TXDMAEN_Msk                                 (0x1U << I2CSMB_CR1_TXDMAEN_Pos)
#define    I2CSMB_CR1_TXDMAEN                                     I2CSMB_CR1_TXDMAEN_Msk

#define    I2CSMB_CR1_RXDMAEN_Pos                                 (15U)
#define    I2CSMB_CR1_RXDMAEN_Msk                                 (0x1U << I2CSMB_CR1_RXDMAEN_Pos)
#define    I2CSMB_CR1_RXDMAEN                                     I2CSMB_CR1_RXDMAEN_Msk

#define    I2CSMB_CR1_SCLSEN_Pos                                  (16U)
#define    I2CSMB_CR1_SCLSEN_Msk                                  (0x1U << I2CSMB_CR1_SCLSEN_Pos)
#define    I2CSMB_CR1_SCLSEN                                      I2CSMB_CR1_SCLSEN_Msk

