zmzdh/CAN_st_test/Drivers/FM33FG0xxA_FL_Driver/Inc/fm33fg0xxa_fl_i2c_smbus.h
#define    I2CSMB_CR1_WKUPEN_Pos                                  (17U)
#define    I2CSMB_CR1_WKUPEN_Msk                                  (0x3U << I2CSMB_CR1_WKUPEN_Pos)
#define    I2CSMB_CR1_WKUPEN                                      I2CSMB_CR1_WKUPEN_Msk

#define    I2CSMB_CR1_GCEN_Pos                                    (19U)
#define    I2CSMB_CR1_GCEN_Msk                                    (0x1U << I2CSMB_CR1_GCEN_Pos)
#define    I2CSMB_CR1_GCEN                                        I2CSMB_CR1_GCEN_Msk

#define    I2CSMB_CR1_SMBHEN_Pos                                  (20U)
#define    I2CSMB_CR1_SMBHEN_Msk                                  (0x1U << I2CSMB_CR1_SMBHEN_Pos)
#define    I2CSMB_CR1_SMBHEN                                      I2CSMB_CR1_SMBHEN_Msk

#define    I2CSMB_CR1_SMBDEN_Pos                                  (21U)
#define    I2CSMB_CR1_SMBDEN_Msk                                  (0x1U << I2CSMB_CR1_SMBDEN_Pos)
#define    I2CSMB_CR1_SMBDEN                                      I2CSMB_CR1_SMBDEN_Msk

#define    I2CSMB_CR1_ALERTEN_Pos                                 (22U)
#define    I2CSMB_CR1_ALERTEN_Msk                                 (0x1U << I2CSMB_CR1_ALERTEN_Pos)
#define    I2CSMB_CR1_ALERTEN                                     I2CSMB_CR1_ALERTEN_Msk

#define    I2CSMB_CR1_AUTOEND_Pos                                 (23U)
#define    I2CSMB_CR1_AUTOEND_Msk                                 (0x1U << I2CSMB_CR1_AUTOEND_Pos)
#define    I2CSMB_CR1_AUTOEND                                     I2CSMB_CR1_AUTOEND_Msk

#define    I2CSMB_CR2_ALERT_Pos                                   (5U)
#define    I2CSMB_CR2_ALERT_Msk                                   (0x1U << I2CSMB_CR2_ALERT_Pos)
#define    I2CSMB_CR2_ALERT                                       I2CSMB_CR2_ALERT_Msk

#define    I2CSMB_CR2_ACKEN_Pos                                   (4U)
#define    I2CSMB_CR2_ACKEN_Msk                                   (0x1U << I2CSMB_CR2_ACKEN_Pos)
#define    I2CSMB_CR2_ACKEN                                       I2CSMB_CR2_ACKEN_Msk

#define    I2CSMB_CR2_RWN_Pos                                     (3U)
#define    I2CSMB_CR2_RWN_Msk                                     (0x1U << I2CSMB_CR2_RWN_Pos)
#define    I2CSMB_CR2_RWN                                         I2CSMB_CR2_RWN_Msk

#define    I2CSMB_CR2_STOP_Pos                                    (2U)
#define    I2CSMB_CR2_STOP_Msk                                    (0x1U << I2CSMB_CR2_STOP_Pos)
#define    I2CSMB_CR2_STOP                                        I2CSMB_CR2_STOP_Msk

#define    I2CSMB_CR2_RESTART_Pos                                 (1U)
#define    I2CSMB_CR2_RESTART_Msk                                 (0x1U << I2CSMB_CR2_RESTART_Pos)
#define    I2CSMB_CR2_RESTART                                     I2CSMB_CR2_RESTART_Msk

#define    I2CSMB_CR2_START_Pos                                   (0U)
#define    I2CSMB_CR2_START_Msk                                   (0x1U << I2CSMB_CR2_START_Pos)
#define    I2CSMB_CR2_START                                       I2CSMB_CR2_START_Msk

#define    I2CSMB_IER_IDLIE_Pos                                   (7U)
#define    I2CSMB_IER_IDLIE_Msk                                   (0x1U << I2CSMB_IER_IDLIE_Pos)
#define    I2CSMB_IER_IDLIE                                       I2CSMB_IER_IDLIE_Msk

#define    I2CSMB_IER_ERRIE_Pos                                   (6U)
#define    I2CSMB_IER_ERRIE_Msk                                   (0x1U << I2CSMB_IER_ERRIE_Pos)
#define    I2CSMB_IER_ERRIE                                       I2CSMB_IER_ERRIE_Msk

#define    I2CSMB_IER_SIE_Pos                                     (5U)
#define    I2CSMB_IER_SIE_Msk                                     (0x1U << I2CSMB_IER_SIE_Pos)
#define    I2CSMB_IER_SIE                                         I2CSMB_IER_SIE_Msk

#define    I2CSMB_IER_PIE_Pos                                     (4U)
#define    I2CSMB_IER_PIE_Msk                                     (0x1U << I2CSMB_IER_PIE_Pos)
#define    I2CSMB_IER_PIE                                         I2CSMB_IER_PIE_Msk

#define    I2CSMB_IER_NACKIE_Pos                                  (3U)
#define    I2CSMB_IER_NACKIE_Msk                                  (0x1U << I2CSMB_IER_NACKIE_Pos)
#define    I2CSMB_IER_NACKIE                                      I2CSMB_IER_NACKIE_Msk

#define    I2CSMB_IER_ADIE_Pos                                    (2U)
#define    I2CSMB_IER_ADIE_Msk                                    (0x1U << I2CSMB_IER_ADIE_Pos)
#define    I2CSMB_IER_ADIE                                        I2CSMB_IER_ADIE_Msk

#define    I2CSMB_IER_TXIE_Pos                                    (1U)
#define    I2CSMB_IER_TXIE_Msk                                    (0x1U << I2CSMB_IER_TXIE_Pos)
#define    I2CSMB_IER_TXIE                                        I2CSMB_IER_TXIE_Msk

#define    I2CSMB_IER_RXIE_Pos                                    (0U)
#define    I2CSMB_IER_RXIE_Msk                                    (0x1U << I2CSMB_IER_RXIE_Pos)
#define    I2CSMB_IER_RXIE                                        I2CSMB_IER_RXIE_Msk

#define    I2CSMB_ISR_SDIR_Pos                                    (16U)
#define    I2CSMB_ISR_SDIR_Msk                                    (0x1U << I2CSMB_ISR_SDIR_Pos)
#define    I2CSMB_ISR_SDIR                                        I2CSMB_ISR_SDIR_Msk

#define    I2CSMB_ISR_ALIF_Pos                                    (13U)
#define    I2CSMB_ISR_ALIF_Msk                                    (0x1U << I2CSMB_ISR_ALIF_Pos)
#define    I2CSMB_ISR_ALIF                                        I2CSMB_ISR_ALIF_Msk

#define    I2CSMB_ISR_TOB_Pos                                     (12U)
#define    I2CSMB_ISR_TOB_Msk                                     (0x1U << I2CSMB_ISR_TOB_Pos)
#define    I2CSMB_ISR_TOB                                         I2CSMB_ISR_TOB_Msk

#define    I2CSMB_ISR_TOA_Pos                                     (11U)
#define    I2CSMB_ISR_TOA_Msk                                     (0x1U << I2CSMB_ISR_TOA_Pos)
#define    I2CSMB_ISR_TOA                                         I2CSMB_ISR_TOA_Msk

#define    I2CSMB_ISR_OVF_Pos                                     (10U)
#define    I2CSMB_ISR_OVF_Msk                                     (0x1U << I2CSMB_ISR_OVF_Pos)
#define    I2CSMB_ISR_OVF                                         I2CSMB_ISR_OVF_Msk

#define    I2CSMB_ISR_BERR_Pos                                    (9U)
#define    I2CSMB_ISR_BERR_Msk                                    (0x1U << I2CSMB_ISR_BERR_Pos)
#define    I2CSMB_ISR_BERR                                        I2CSMB_ISR_BERR_Msk

